In [66]:
import numpy as np
import pandas as pd
import netCDF4 as nc
from datetime import date, timedelta
import os
import xarray as xr

In [67]:
df = pd.read_csv("../data/raw/hurdat2_cleaned.csv", parse_dates=['formation_datetime', 'observation_datetime'])

In [68]:
def calc_summand(v):
	return v**2 if v >= 34 else 0

In [69]:
df['vmax_squared_gt_32'] = df.apply(func = lambda row: calc_summand(row['max_sus_wind_kt']), axis=1)
df.head()

,code,name,record_identifier,status,max_sus_wind_kt,min_pressure_mb,r_34kt_ne,r_34kt_se,r_34kt_sw,r_34kt_nw,...,r_64kt_ne,r_64kt_se,r_64kt_sw,r_64kt_nw,r_max_sus,observation_datetime,formation_datetime,lat,lon,vmax_squared_gt_32
0,AL011851,UNNAMED,NaN,HU,80.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,1851-06-25 00:00:00,1851-06-25,28.0,265.2,6400.0
1,AL011851,UNNAMED,NaN,HU,80.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,1851-06-25 06:00:00,1851-06-25,28.0,264.6,6400.0
2,AL011851,UNNAMED,NaN,HU,80.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,1851-06-25 12:00:00,1851-06-25,28.0,264.0,6400.0
3,AL011851,UNNAMED,NaN,HU,80.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,1851-06-25 18:00:00,1851-06-25,28.1,263.5,6400.0
4,AL011851,UNNAMED,L,HU,80.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,1851-06-25 21:00:00,1851-06-25,28.2,263.2,6400.0

In [70]:
gb = df.groupby('code').agg({'vmax_squared_gt_32': 'sum'})

In [71]:
gb.vmax_squared_gt_32 = gb.vmax_squared_gt_32 / 10**4
gb

          vmax_squared_gt_32
code
AL011851              5.5500
AL011852             26.3600
AL011853              0.2500
AL011854              3.9000
AL011855              0.8100
...                      ...
AL301969              0.0000
AL302005             13.3625
AL302020              5.5875
AL312005              6.2650
AL312020             13.8800

[1991 rows x 1 columns]

In [72]:
gb.columns = ['ace']
gb

              ACE
code
AL011851   5.5500
AL011852  26.3600
AL011853   0.2500
AL011854   3.9000
AL011855   0.8100
...           ...
AL301969   0.0000
AL302005  13.3625
AL302020   5.5875
AL312005   6.2650
AL312020  13.8800

[1991 rows x 1 columns]

In [73]:
gb.reset_index(inplace = True)

In [74]:
gb.to_csv('data/ace.csv', index=False)